In [1]:
import pandas as pd 
import numpy as np

In [2]:
dict1={'name':['anurag','alok','ankur','akash','karan','arjun'],
       'age':[33,44,55,66,66,88,],
       'city':['lucknow','delhi','dehri','mumbai','patne','new delhi']}

In [3]:
data=pd.DataFrame(dict1)
data

     name  age       city
0  anurag   33    lucknow
1    alok   44      delhi
2   ankur   55      dehri
3   akash   66     mumbai
4   karan   66      patne
5   arjun   88  new delhi

In [4]:
data.to_csv('anurag.csv')

In [5]:
data.head(3)

     name  age     city
0  anurag   33  lucknow
1    alok   44    delhi
2   ankur   55    dehri

In [6]:
data.tail(2)

    name  age       city
4  karan   66      patne
5  arjun   88  new delhi

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   city    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [8]:
data.describe()

             age
count   6.000000
mean   58.666667
std    19.263091
min    33.000000
25%    46.750000
50%    60.500000
75%    66.000000
max    88.000000

In [9]:
data.isnull().sum()

name    0
age     0
city    0
dtype: int64

In [11]:
data.index=['first','second','third','forth','fifth','sixth']

In [12]:
data

          name  age       city
first   anurag   33    lucknow
second    alok   44      delhi
third    ankur   55      dehri
forth    akash   66     mumbai
fifth    karan   66      patne
sixth    arjun   88  new delhi

In [13]:
data.columns

Index(['name', 'age', 'city'], dtype='object')

In [17]:
data.index

Index(['first', 'second', 'third', 'forth', 'fifth', 'sixth'], dtype='object')

In [23]:
data.loc[['second','third'],['name','age']]

         name  age
second   alok   44
third   ankur   55

In [31]:
data.loc[['first','second'],:]

          name  age     city
first   anurag   33  lucknow
second    alok   44    delhi